#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.fetcher will be created
  + resource "aws_ecr_repository" "fetcher" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "fetcher"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
        }
      + tags_all             = {
          + "Environment" = "prod"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.web will be created
  + resource "aws_ecr_repository" "web" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "web"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
        }
      + tags_all             = {
          + "Environment" = "prod"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.iam.aws_iam_access_key.github_deployer_access_key will be created
  + resource "aws_iam_access_key" "github_deployer_access_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "github_deployer"
    }

  # module.iam.aws_iam_user.github_deployer will be created
  + resource "aws_iam_user" "github_deployer" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "github_deployer"
      + path          = "/"
      + tags          = {
          + "Environment" = "prod"
        }
      + tags_all      = {
          + "Environment" = "prod"
        }
      + unique_id     = (known after apply)
    }

  # module.iam.aws_iam_user_policy.github_deployer_policy will be created
  + resource "aws_iam_user_policy" "github_deployer_policy" {
      + id     = (known after apply)
      + name   = "github_deployer_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "github_deployer"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @peterussell, Action: `pull_request`*